// Unreal10th_Cpp.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#define _CRT_SECURE_NO_WARNINGS
#include <iostream>

int main()
{
	int Age = 0;

	printf("자신의 나이를 입력하세요 : ");
	std::cin >> Age;

	printf("당신의 나이는 %d세 입니다.", Age);

	// 변수 (variable)
	// - 변하는 숫자
	// - 컴퓨터한테 값을 기억시키기 위해 만들고 사용한다
	// - 메모리의 일정 공간을 확보하고 이름을 붙여 사용한다
	// - DATA_TYPE VARIABLE_NAME; 형식으로 선언

	// 명명 규칙
	// - 중요하다
	// - 길이가 길어지더라도 알아보기 쉽고 간결해야한다
	// 

	// int (Integer)
	// - 정수형 타입 (소수점이 없는 숫자)
	// - 일반적으로 32bit 크기를 가진다 (CPU가 한 번에 처리할 수 있는 데이터 크기에 따라 달라짐)
	// - 숫자 범위를 벗어나는 값을 넣으면 넘쳐서 반대쪽으로 돌아가버린다 (오버플로우, 언더플로우)
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
